# day17_regression_metrics.py
# 회귀 성능 지표 MAE, MSE, RMSE, R^2

'''
회귀 모델에서는 예측값이 실제 값과 얼마나 가까운지를 평가하기 위해 여러 지표를 사용함

    1.MAE(Mean Absolute Error: 평균 절대 오차)
        - 실제값과 예측값 차이의 절대 값의 평균
        - 0에 가까울 수록 좋음
    2. MSE(Mean Squared Error: 평균 제곱 오차)
        - 오차를 제곱한 뒤 평균
        - 더 큰 오차를 부각시키기 위해서 제곱을 함
        - 0에 가까울 수록 좋음
    3. RMSE(Root Mean Squared Error: 제곱근 평균 제곱 오차)
        - MSE의 제곱근
        - MSE는 MSE 인데 실제값에 가까운 MSE가 필요할떄
        - 0 에 가까울  수록 좋음
    4. R^2(R-squared 또는 Coefficient of Determination: 결정계수)
        - 모델이 실제 데이터의 변동을 얼마나 설명하는지에 대한 지표
        - 1 에 가까울 수록 좋음

# https://editor.codecogs.com/ : LaTex 문법 > 수식

# MAE
# MAE 수식 : $$ MAE = \frac{1}{n}\sum_{i=1}^{n}|y_i-\hat{y_i}| $$

예를 들어 실제 아파트 가격과 예측 가격이 다음과 같다고 가정
    실제값     예측값     오차      절대오차
    -------------------------------------
    100       110       -10       10
    200       190       -10       10
    300       330       -30       30

MAE는 수식에 의해 10 + 10 + 30 / 3 => 16.66...
즉, 모델의 예측값이 실제값 에서 평균적으로 약 16.67 만큼 벗어남을 의미
MAE 의 가장 큰 장점은 원래 데이터와 단위가 같아서 해석하기 용이 하다는 것


# MSE
# MSE 수식 : $$ MSE = \frac{1}{n}\sum_{i=1}^{n}(y_i-\hat{y_i})^2 $$

예를 들어 실제 아파트 가격과 예측 가격이 다음과 같다고 가정
    실제값     예측값     오차      오차^2
    -------------------------------------
    100       110       -10       100
    200       190       -10       100
    300       330       -30       900

MSE는 수식에 의해 100 + 100 + 900 / 3 = 366.66...
MSE의 중요한 특징은 더 큰 오차에 더큰 벌정(Penakty)을 준다는 것
예를 들어 오차가 10이면 100으로, 오차가 50이면 2500으로 부여해서
더큰 오차가 부각 되도록 만듬
따라서 이상치나 큰 예측 실패가 있을 경우 MSE값이 크게 증가할 수 있음

MSE 는 단위가 원래 단위가 아니라 제곱된 값이 되무로
 실제 업무상의(데이터상의) 단위로 해석 하면 안됨

# RMSE
    - RMSE 수식 : MSE에 제곱근
    - MSE의 값은 데이터의 값과 동떨어져 있으므로 실제 값과
    유사한 오차값을 사용할때는 RMSE를 사용함

# R^2
# R^2 수식 : $$ R^2 = 1- \frac{\sum(y_i-\hat{y_i})^2} {\sum(y_i-\bar{y})^2} $$
#           쉽게 말하면 우리가 만든 모델의 오차 / 평균값으로만 예측했을때의 오차
# R^2의 해석
    - 1.0 : 실제값을 완벽하게 설명 (좋은 모델? 문제여부를 살펴봐야함)
    - 0.9 : 모델이 데이터 변동의 약 90% 설명 (좋은 모델)
    - 0.5 : 모델이 데이터 변동의 약 50% 설명
    - 0.0 : 모델이 평균 값으로만 예측하는 모델과 성능이 비슷하다
    - 음수 : 모델이 평균값으로만 예측하는 모델보다 성능이 떨어짐
(^-^)7 충성!
'''
import numpy as np
from python.print_util import pp
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

y_test = [ 300,350,400,450,500] # 실제값

y_pred = [310,340,420,440,510] # 예측값

mae = mean_absolute_error(y_test, y_pred) # MAE 계산

mse = mean_squared_error(y_test, y_pred) # MSE 계산

rmse = np.sqrt(mse) # RMSE 계산

r2 = r2_score(y_test, y_pred)  # R^2 계산


pp('MAE: ', mae) # 12.0
pp('MSE: ', mse) # 160.0
pp('RMSE: ', rmse) # 12.649110640673518
pp('R^2: ', r2) #0.968
# 지표해석
'''
MAE : 예측값과 실제 값은 평균 12.0 차이가 남
MSE : 값이 클수록 이상치나 큰오차가 있다
RMSE : MSE는 실제 오차와 차이가 크므로 실제 오차에 가깝게 만든것
        RMSE가 MAE 보다 크면 일부 데이터에서 상대적으로 큰 예측오차가 있음
R^2 : 모델이 종속변수의 변동을 약 96.8% 설명. 설명력이 강한 모델
x = 독립변수, 입력값, Feature
y = 종속변수, 결과값, Target
'''

















