# day13_ex2.py
# 주제: 정규 표현식(Regular Expression)
# : 문자열 내에서 특정 패턴을 만족하는 문자열을 탐색, 존재여부 확인, 치환할때 사용

# 패턴 문자열
'''
임의의 문자 하나
    .       : 임의의 문자하나
    ^       : 문자열의 시작 #캐럿
    $       : 문자열의 끝
    *       : 0개이상반복
    +       : 1개이상반복
    ?       : 0개 또는 1개
    {n}     : n번 반복
    {n,}    : n번 이상 반복
    {n,m}   : n번이상, m번 이하 반복
    []      : 문자 집합
    ()      : 캡춰링 (탐색한 것을 저장)
    \d      : 숫자 하나 = [0-9]
    \D      : 숫자가 아닌 문자 하나
    \w      : 워드 문자 하나(워드문자 : 영문 대소문자 또는 숫자 또는 _문자)
    \W      : 워드 문자가 아닌 문자
    \s      : 공백 문자 하나 (스페이스, 탭, 엔터...)
    \S      : 공백 문자가 아닌 문자 하나
    [a-z]   : 소문자 a부터 z까지 문자중 하나 = 영문소문자 하나
    [A-Z]   : 소문자 A부터 Z까지 문자중 하나 = 영문소문자 하나
    [0-9]   : 숫자 하나
    [가-힣]  : 한글 문자 하나
'''

# 패턴 옵션
'''
    i (ignorecase)  : 대소문자 구별없이 탐색
    g (global)      : 전체 영역 에서 탐색
    m (multi-line)  : 문자열이 여러 줄로 되어 있을때 각 줄의 처음과 끝에서 탐색
'''

from python.print_util import pp
import re # 정규 표현식 사용을 위한 라이브러리

text = '주문번호 A1023, 금액 45,000원'

# 1. re.findall(패턴문자열, 원본 문자열)
# 원본 문자열에서 패턴을 따르는 문자열들의 리스트를 반환
nums = re.findall(r'\d+', text) # 숫자가 1개이상 패턴
pp(nums) # ['1023', '45', '000']

# 2. re.search(패턴문자열,원본문자열)
# 원본 문자열에서 패턴을 따르는 문자열이 있으면 True 반환
if re.search(r'금액', text): #'금' 이오고 '액' 이오는 패턴
    pp('"금액"이라는 문자열이 있음')

# 3. re.sub(패턴문자열, 대체문자열, 원본 문자열)
# 원본 문자열에서 패턴을 따르는 문자열을 대체 문자열로 치환
clean = re.sub(r',','',text) #',' 문자가 오는 패턴
pp(clean)