# day4_basic.py
# AI휴먼 Day 4 - Basic 과제
# 주제: 점수 1개의 합격 여부 판정

# [목표]
# 사용자가 점수를 입력하면 조건문으로 합격 여부를 출력하는 프로그램을 작성합니다.

# [요구사항]
# input()으로 점수를 입력받습니다.
# 입력값을 int()를 사용해 정수로 변환합니다.
# 점수가 60점 이상이면 "PASS"를 출력합니다.
# 점수가 60점 미만이면 "RETRY"를 출력합니다.
# if와 else를 반드시 사용합니다.
score = int(input("점수를 입력하세요(0~100): "))
if score < 0 or score > 100: # 범위 벗어남
    print('0~100 범위를 벗어났습니다')
else:
    if score >= 60:
        print('PASS')
    else:
        print('RETRY')



# [실행 예 1]
# 점수: 75
# PASS

# [실행 예 2]
# 점수: 59
# RETRY

# [확인해야 할 경계값]
# 59
# 60
# 61

# [제출 전 확인]
# input()을 사용했는가?   > 했읍
# int()로 형변환했는가?    > 당연
# >= 연산자를 올바르게 사용했는가?   > 했음
# if와 else의 들여쓰기가 올바른가? > 당근